# shared - production
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
./src/shared/infrastructure/workspaces/production relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/Connectilly/Connectilly/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/Connectilly/Connectilly

To view this run in a browser, visit:
https://app.terraform.io/app/connectilly/production-shared/runs/run-1cr6jToyechTJmUJ

Waiting for the plan to start...

Terraform v1.4.6
on linux_amd64
Initializing plugins and modules...
module.common.module.cluster.cockroach_cluster.default: Refreshing state... [id=5978340e-bcd6-4d4b-b6ed-75b3e1069f43]
module.common.module.kafka.upstash_kafka_cluster.default: Refreshing state... [id=upstash-cluster-c668a3f1-5716-4d1b-a41a-a38dd2cb6375]
module.common.module.kafka.aws_ssm_parameter.default: Refreshing state... [id=production-kafka-cluster-id]
module.common.module.cluster.aws_ssm_parameter.default: Refreshing state... [id=production-cockroachdb-serverless-cluster-id]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.common.module.cluster.aws_ssm_parameter.default will be destroyed
  # (because aws_ssm_parameter.default is not in configuration)
  - resource "aws_ssm_parameter" "default" {
      - arn       = "arn:aws:ssm:us-east-1:514472330244:parameter/production-cockroachdb-serverless-cluster-id" -> null
      - data_type = "text" -> null
      - id        = "production-cockroachdb-serverless-cluster-id" -> null
      - key_id    = "alias/aws/ssm" -> null
      - name      = "production-cockroachdb-serverless-cluster-id" -> null
      - tags      = {
          - "environment"   = "production"
          - "resource"      = "shared"
          - "resource_type" = "serverless-cluster"
        } -> null
      - tags_all  = {
          - "environment"   = "production"
          - "resource"      = "shared"
          - "resource_type" = "serverless-cluster"
        } -> null
      - tier      = "Standard" -> null
      - type      = "SecureString" -> null
      - value     = (sensitive value) -> null
      - version   = 1 -> null
    }

  # module.common.module.cluster.cockroach_cluster.default will be destroyed
  # (because cockroach_cluster.default is not in configuration)
  - resource "cockroach_cluster" "default" {
      - cloud_provider    = "AWS" -> null
      - cockroach_version = "v22.2" -> null
      - creator_id        = "fabfb4b1-94a9-41c0-8736-d72b2a6f6538" -> null
      - id                = "5978340e-bcd6-4d4b-b6ed-75b3e1069f43" -> null
      - name              = "production-connectilly" -> null
      - operation_status  = "UNSPECIFIED" -> null
      - plan              = "SERVERLESS" -> null
      - regions           = [
          - {
              - name       = "us-east-1" -> null
              - node_count = 0 -> null
              - primary    = true -> null
              - sql_dns    = "free-tier14.aws-us-east-1.cockroachlabs.cloud" -> null
              - ui_dns     = "" -> null
            },
        ] -> null
      - serverless        = {
          - routing_id  = "production-connectilly-10574" -> null
          - spend_limit = 0 -> null
        } -> null
      - state             = "CREATED" -> null
      - upgrade_status    = "FINALIZED" -> null
    }

  # module.common.module.cockroachdb_serverless_cluster.aws_ssm_parameter.default will be created
  + resource "aws_ssm_parameter" "default" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "production-cockroachdb-serverless-cluster-id"
      + tags           = {
          + "environment"   = "production"
          + "resource"      = "shared"
          + "resource_type" = "serverless-cluster"
        }
      + tags_all       = {
          + "environment"   = "production"
          + "resource"      = "shared"
          + "resource_type" = "serverless-cluster"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.common.module.cockroachdb_serverless_cluster.cockroach_cluster.default will be created
  + resource "cockroach_cluster" "default" {
      + account_id        = (known after apply)
      + cloud_provider    = "AWS"
      + cockroach_version = (known after apply)
      + creator_id        = (known after apply)
      + id                = (known after apply)
      + name              = "production-connectilly"
      + operation_status  = (known after apply)
      + plan              = (known after apply)
      + regions           = [
          + {
              + name       = "us-east-1"
              + node_count = (known after apply)
              + primary    = (known after apply)
              + sql_dns    = (known after apply)
              + ui_dns     = (known after apply)
            },
        ]
      + serverless        = {
          + routing_id  = (known after apply)
          + spend_limit = 0
        }
      + state             = (known after apply)
      + upgrade_status    = (known after apply)
    }

  # module.common.module.kafka.aws_ssm_parameter.default will be destroyed
  # (because aws_ssm_parameter.default is not in configuration)
  - resource "aws_ssm_parameter" "default" {
      - arn       = "arn:aws:ssm:us-east-1:514472330244:parameter/production-kafka-cluster-id" -> null
      - data_type = "text" -> null
      - id        = "production-kafka-cluster-id" -> null
      - key_id    = "alias/aws/ssm" -> null
      - name      = "production-kafka-cluster-id" -> null
      - tags      = {
          - "environment"   = "production"
          - "resource"      = "shared"
          - "resource_type" = "kafka-cluster"
        } -> null
      - tags_all  = {
          - "environment"   = "production"
          - "resource"      = "shared"
          - "resource_type" = "kafka-cluster"
        } -> null
      - tier      = "Standard" -> null
      - type      = "SecureString" -> null
      - value     = (sensitive value) -> null
      - version   = 1 -> null
    }

  # module.common.module.kafka.upstash_kafka_cluster.default will be destroyed
  # (because upstash_kafka_cluster.default is not in configuration)
  - resource "upstash_kafka_cluster" "default" {
      - cluster_id              = "c668a3f1-5716-4d1b-a41a-a38dd2cb6375" -> null
      - cluster_name            = "production-connectilly" -> null
      - creation_time           = 1682575213 -> null
      - id                      = "upstash-cluster-c668a3f1-5716-4d1b-a41a-a38dd2cb6375" -> null
      - max_message_size        = 1048576 -> null
      - max_messages_per_second = 1000 -> null
      - max_partitions          = 100 -> null
      - max_retention_size      = -1 -> null
      - max_retention_time      = -1 -> null
      - multizone               = false -> null
      - password                = (sensitive value) -> null
      - region                  = "us-east-1" -> null
      - rest_endpoint           = "resolved-elf-13531-us1-rest-kafka.upstash.io" -> null
      - state                   = "active" -> null
      - tcp_endpoint            = "resolved-elf-13531-us1-kafka.upstash.io" -> null
      - type                    = "paid" -> null
      - username                = "cmVzb2x2ZWQtZWxmLTEzNTMxJMinFHKsmIaM4GPPhjwqRIUIwwVrXI6AQQSRI6I" -> null
    }

  # module.common.module.kafka_serverless_cluster.aws_ssm_parameter.default will be created
  + resource "aws_ssm_parameter" "default" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "production-kafka-cluster-id"
      + tags           = {
          + "environment"   = "production"
          + "resource"      = "shared"
          + "resource_type" = "kafka-cluster"
        }
      + tags_all       = {
          + "environment"   = "production"
          + "resource"      = "shared"
          + "resource_type" = "kafka-cluster"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.common.module.kafka_serverless_cluster.upstash_kafka_cluster.default will be created
  + resource "upstash_kafka_cluster" "default" {
      + cluster_id              = (known after apply)
      + cluster_name            = "production-connectilly"
      + creation_time           = (known after apply)
      + id                      = (known after apply)
      + max_message_size        = (known after apply)
      + max_messages_per_second = (known after apply)
      + max_partitions          = (known after apply)
      + max_retention_size      = (known after apply)
      + max_retention_time      = (known after apply)
      + multizone               = false
      + password                = (sensitive value)
      + region                  = "us-east-1"
      + rest_endpoint           = (known after apply)
      + state                   = (known after apply)
      + tcp_endpoint            = (known after apply)
      + type                    = (known after apply)
      + username                = (known after apply)
    }

Plan: 4 to add, 0 to change, 4 to destroy.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*